In [2]:
import pandas as pd
import matplotlib.pyplot as plt
from config import username, password
%matplotlib inline

from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employees sql')
connection = engine.connect()

In [4]:
#Convert to database
salary_df = pd.read_sql_query('select * from salaries', connection)
salary_df.head(3)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006